Revit 2027 API
PDFExportOptions.SetNamingRule Method
 Sets the naming rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetNamingRule(
	IList<TableCellCombinedParameterData> namingRule
)
Public Sub SetNamingRule (
	namingRule As IList(Of TableCellCombinedParameterData)
)
public:
void SetNamingRule(
	IList<TableCellCombinedParameterData^>^ namingRule
)
member SetNamingRule :
        namingRule : IList<TableCellCombinedParameterData> -> unit
Parameters
namingRule IList<TableCellCombinedParameterData>
 The naming rule.
Exceptions
Exception | Condition
ArgumentException |  The namingRule is empty or contains illegal characters.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace